bashing-is-better-than-extending.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgde8f83e">Introduction</a></li>
<li><a href="#org2009368">Lever</a></li>
<li><a href="#org26899e4">Hello, bash-completion</a></li>
<li><a href="#orgaee1741">async-shell-command and friends</a></li>
<li><a href="#org506a8bb">babashka tasks</a></li>
<li><a href="#orgd5dab99">compilation</a></li>
<li><a href="#org59ee1a1">It gets even better</a></li>
<li><a href="#org111bb47">more levers</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgde8f83e" class="outline-2">
<h2 id="orgde8f83e">Introduction</h2>
<div class="outline-text-2" id="text-orgde8f83e">
<p>
I sometimes get asked something along the lines of
</p>


<blockquote>
<p>
What is the single most important package in your emacs config that
makes you more productive?
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org2009368" class="outline-2">
<h2 id="org2009368">Lever</h2>
<div class="outline-text-2" id="text-org2009368">
<p>
Levers are great.
They make it possible to have a large effect with little
</p>

<p>
effort
output with input
</p>
</div>
</div>



<div id="outline-container-org26899e4" class="outline-2">
<h2 id="org26899e4">Hello, bash-completion</h2>
</div>

<div id="outline-container-orgaee1741" class="outline-2">
<h2 id="orgaee1741">async-shell-command and friends</h2>
</div>


<div id="outline-container-org506a8bb" class="outline-2">
<h2 id="org506a8bb">babashka tasks</h2>
<div class="outline-text-2" id="text-org506a8bb">
<p>
I can write build tasks in my favority language clojure, with the
development ergonomics of a lisp.
</p>
</div>
</div>



<div id="outline-container-orgd5dab99" class="outline-2">
<h2 id="orgd5dab99">compilation</h2>
<div class="outline-text-2" id="text-orgd5dab99">
<p>
Using emacs <code>project.el</code> I get a beautiful flow of invoking bb tasks:
I just need a project with a <code>.git</code> dir.
And I invoke <code>project-compile</code>, type in ~bb
</p>
</div>
</div>


<div id="outline-container-org59ee1a1" class="outline-2">
<h2 id="org59ee1a1">It gets even better</h2>
<div class="outline-text-2" id="text-org59ee1a1">
<p>
Sometimes you want to run the same command over and over.
For example when compiling or devving some script.
</p>

<p>
Now you might start doing
scm
and the <code>C-p</code> to go up in the history everytime.
</p>


<p>
With a recent version of emacs
revert-buffer-function
Lol, so good.
</p>
</div>
</div>






<div id="outline-container-org111bb47" class="outline-2">
<h2 id="org111bb47">more levers</h2>
<div class="outline-text-2" id="text-org111bb47">
<p>
a lever
a doorway
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.4)</p>
</div>
</body>
</html>
